let handler = async (m, { command, text }) => m.reply(`*╔═╼─╾─╾═【🕸️】═╼─╾╾─╾═╗*
*⎔⋅• ━ ╼╃ ⌬〔﷽〕⌬ ╄╾ ━ •⋅⎔*
*﹝♦️↓ اسـتـمـارة الـدخـول ↓♦️﹞*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾🍷↿┊اللـقـب ⇇〔 〕*
*↾🎥↿┊مـن انـمـي ⇇〔 〕*
*↾🎎↿┊بـنـت او ولـد ⇇〔 〕*
*↾🎓↿┊مـن طـرف ⇇〔 〕*
*↾🌅↿┊صـورة للـقـب ⇇〔 〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾❌↿┊مـمـنـوع الـسـوالـف〕*
*↾❌↿┊مـمـنـوع القاب الـ 18+〕*
*↾❌↿┊مـمـنـوع السـب و الـشـتـم〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*﹝تـوقـيـع↓📜↓مـمـلكة﹞*
*┊𝐎𝐒𝐀𝐊𝐀 𓆩💧𓆪 𝐊.𝐍.𝐆┊*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استقبال']
handler.tags = ['استمارة استقبال']
handler.command = /^(الاستماره|1|استماره\استمارة)$/i

export default handler


let handler = async (m, { command, text }) => m.reply(`*╔═╼─╾─╾═【🕸️】═╼─╾╾─╾═╗*
*⎔⋅• ━ ╼╃ ⌬〔﷽〕⌬ ╄╾ ━ •⋅⎔*
*﹝تـرحـيـب↓🪽↓عـضـو﹞*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾🏮↿┊اللـقـب ⇇〔〕*
*↾🎥↿┊مـن انـمـي ⇇〔〕*
*↾📧↿┊الـمـنـشـن ⇇〔〕*
*↾🎐↿┊الـمـسـؤول ⇇〔〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾🌼↿┊اشرقـت بك الانـوار بوجـودك مـعـنا و نُـرحـب بـكِ اشـد الـترحيـب و لتـسـتـمـتـع بـوقـت جـمـيل فـي نقابـتـنا☁️✨〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*﹝تـوقـيـع↓📜↓مـمـلكة﹞*
*┊𝐎𝐒𝐀𝐊𝐀 𓆩💧𓆪 𝐊.𝐍.𝐆┊*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استمارة-الترحيب']
handler.tags = ['استمارة الترحيب']
handler.command = /^(\استمارة-الترحيب)$/i

export default handler


