let handler = async (m, { conn }) => {
    const name = conn.getName(m.sender);
    let videoUrl = 'https://telegra.ph/file/18db853002c9bd7be317c.mp4';
    let tagUser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let more = String.fromCharCode(8206);
    let teks = `${pickRandom([`
*𖣐╭──𓆩♕𝙎𝙃𝙄𝙆𝘼🐥ᵇᵒᵗ♕𓆪──╮𖣐*
*⌬ اهلا ياحـب معـك:-*
*⎊『♕شيكـا 🐥 بوت♕』*
*• ━ ──⎔*
*⌬ معلومـات البــوت:-* 
*☬↫الاسم👤*
*『شيكـا🐥』*
*☬↫المطـور👨🏻‍💻*
*『شيكا🐥 - +201005603546』*
*☬↫تابـع لـ⚜️*
*『نقــابة ستــورم🔱』*
*〄━━━⌬『الاوامــر📜』⌬━━━〄*


*┇ــــــــــــــــــــــ『🐥』ــــــــــــــــــــ┇*
*┇• ━ ──⎔ 『المجمــوعه 🔮』 ☬↫〔منشن ✨〕*
*┇• ━ ──⎔ 『الاعضاء 🧑‍🧑‍🧒‍🧒』*
*☬↫〔رابطي 🔗〕*
*☬↫〔لقبني 🪪〕*
*┇• ━ ──⎔ 『الالعـاب 🎮』*
*☬↫〔كوره ⚽〕*
*☬↫〔سيارات 🚘〕*
*☬↫〔علم 🏳〕*
*☬↫〔احزر ⁉️〕*
*☬↫〔عين 👁〕*
*☬↫〔رياضه 🧮〕*
*☬↫〔زواج 🤵🏻👰🏻〕*
*☬↫〔طلاق 👨🏻‍⚖️👩🏻‍⚖️〕*
*☬↫〔صداقه 🧑🏻👩🏻〕*
*☬↫〔حب 👩‍❤️‍👨〕*
*☬↫〔زوجني 🫂〕*
*☬↫〔اكس ❌⭕〕*
*┇• ━ ──⎔ 『الترفيــه 📍』*
*☬↫〔تاج 👀〕*
*☬↫〔توب 🔟〕*
*☬↫〔هل ❓〕*
*☬↫〔لو ❗〕*
*☬↫〔حكمه ✨〕*
*☬↫〔نصيحه 🧙🏻‍♂️〕*
*┇• ━ ──⎔ 『التحميــل ♻️』 ☬↫〔ايديت🎞〕*
*☬↫〔تطبيق 🪀〕*
*┇• ━ ──⎔ 『صور-ai🩻』 ☬↫〔تخيل 🪄〕*
*☬↫〔فلتره 🀄〕*
*☬↫〔فلتر-الوان 🎴〕*
*┇• ━ ──⎔ 『التحــويل 🔄』☬↫〔لملصق 🃏〕*
*☬↫〔ستيك 🪩〕*
*┇• ━ ──⎔ 『الديــن 🕌』*
*☬↫〔الله 9️⃣9️⃣〕*
*☬↫〔قران 📖〕*
*☬↫〔ايات 🕋〕*
*┇• ━ ──⎔ 『انمــي 🎌』*
*☬↫〔دراغون-بول 🐲〕*
*☬↫〔لوفي 👒〕*
*☬↫〔هنتر 🕸〕*
*☬↫〔جوجيتسو 👹〕*
*☬↫〔بنت انمي〕*
*☬↫〔وايفو 🔥〕*
*┇• ━ ──⎔ 『البنك 🏦』*
*┇• ━ ──⎔ 『المطــور 👨🏻‍💻』*
*☬↫〔المطور 👨🏻‍💻〕*
*☬↫〔الدخول-لمجموعه🚪〕*
*⎊╎———————————╎⎊*
*⌬ البــوت قيــد التعديل والتطــوير👨🏻‍💻*`])}`.trim();

    conn.sendMessage(m.chat, {
        video: { url: videoUrl },
        caption: teks,
        gifPlayback: true,
        gifAttribution: 0
    }, { quoted: m });
};

handler.command = ['menu', 'help', 'h', 'اوامر', 'مهام', 'الاوامر', 'المهام'];

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
}
